Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp


#include "dfr1154_cam_controller.h"

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DFRobot_LTR308.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <Wire.h>
#include <esp_camera.h>
#include <math.h>
#include <memory>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "camera_common.h"
#include "dfr1154_config.h"
#include "dfr1154_pins.h"
#include "dfr1154_server_capture.h"
#include "esp32_rtsp_streamer.h"

namespace {

WiFiServer g_rtspServer(dfrcfg::kRtspPort);
WiFiClient g_mqttSocket;
PubSubClient g_mqttClient(g_mqttSocket);
Preferences g_preferences;
DFRobot_LTR308 g_lightSensor;
std::unique_ptr<Esp32RtspStreamer> g_streamer;

bool g_cameraReady = false;
bool g_psramReady = false;
bool g_lightReady = false;
bool g_wifiStarted = false;
bool g_rtspServerStarted = false;
bool g_mdnsReady = false;
bool g_timeConfigured = false;
bool g_streamEnabled = true;
bool g_networkServicesPending = false;
bool g_otaReady = false;
bool g_otaActive = false;
bool g_mqttEverConnected = false;

volatile bool g_wifiGotIpEvent = false;
volatile bool g_wifiDisconnectedEvent = false;
volatile uint8_t g_wifiDisconnectReason = 0;

framesize_t g_frameSize = FRAMESIZE_UXGA;
int g_jpegQuality = 10;
int g_brightness = 1;
int g_contrast = 0;
int g_saturation = -2;
int g_sharpness = 0;
int g_hmirror = 0;
int g_vflip = 1;
int g_ledEnabled = 0;
int g_streamFps = dfrcfg::kDefaultRtspFps;

// OV3660 controls exposed by DFRobot's CameraWebServer example.
int g_gainCeiling = 0;
int g_colorbar = 0;
int g_awb = 1;
int g_agc = 1;
int g_aec = 1;
int g_awbGain = 1;
int g_agcGain = 0;
int g_aecValue = 300;
int g_aec2 = 0;
int g_dcw = 1;
int g_bpc = 0;
int g_wpc = 1;
int g_rawGma = 1;
int g_lenc = 1;
int g_specialEffect = 0;
int g_wbMode = 0;
int g_aeLevel = 0;

// 0 = off, 1 = on, 2 = automatic from the LTR-308.
int g_irMode = 2;
bool g_irEnabled = false;
float g_irOnBelowLux = dfrcfg::kDefaultIrOnBelowLux;
float g_irOffAboveLux = dfrcfg::kDefaultIrOffAboveLux;
float g_ambientLux = NAN;

String g_lastStatus = "booting";
String g_lastError;
uint32_t g_lastWifiAttemptMs = 0;
uint32_t g_lastMqttAttemptMs = 0;
uint32_t g_lastFrameAtMs = 0;
uint32_t g_lastStatsMs = 0;
uint32_t g_lastLightReadMs = 0;
uint32_t g_framesSent = 0;
uint32_t g_lastCameraHealthCheckMs = 0;
uint32_t g_lastCameraRecoveryAttemptMs = 0;
uint32_t g_wifiReconnectCount = 0;
uint32_t g_mqttReconnectCount = 0;
uint32_t g_cameraRecoveryCount = 0;
uint32_t g_mqttPublishFailures = 0;
uint8_t g_wifiAttemptCount = 0;
uint8_t g_cameraRecoveryFailures = 0;
bool g_cameraRecoveryPending = false;
float g_lastMeasuredFps = 0.0f;

String g_lastCommandId;
String g_lastCommandName;
String g_lastCommandResult = "none";
String g_lastCommandMessage;
uint32_t g_lastCommandAtMs = 0;
String g_pendingMqttTopic;
String g_pendingMqttPayload;
bool g_pendingMqttMessage = false;

int clampValue(int value, int minimum, int maximum) {
  return camcommon::clampInt(value, minimum, maximum);
}

String mqttTopic(const char *suffix) {
  return String(dfrcfg::kMqttBaseTopic) + "/" + suffix;
}

int directSessionCount() {
  return g_streamer != nullptr ? g_streamer->sessionCount() : 0;
}

int directStreamingSessionCount() {
  return g_streamer != nullptr ? g_streamer->streamingSessionCount() : 0;
}

const char *frameSizeName() {
  return camcommon::frameSizeName(g_frameSize);
}

framesize_t frameSizeFromIndex(int index) {
  return camcommon::frameSizeFromIndex(index, g_frameSize, true);
}

int frameSizeToIndex(framesize_t size) {
  return camcommon::frameSizeToIndex(size, 2);
}

const char *irModeName() {
  switch (g_irMode) {
    case 0: return "off";
    case 1: return "on";
    default: return "auto";
  }
}

String rtspUrl() {
  if (WiFi.status() != WL_CONNECTED) return "";
  return camcommon::rtspUrl(
      WiFi.localIP(), dfrcfg::kRtspPort, dfrcfg::kRtspPresentation, dfrcfg::kRtspStream);
}

String streamState() {
  if (g_otaActive) return "updating";
  if (g_cameraRecoveryPending) return "recovering";
  if (!g_cameraReady) return "camera_error";
  if (WiFi.status() != WL_CONNECTED) return "wifi_down";
  if (!g_streamEnabled) return "paused";
  return directStreamingSessionCount() > 0 ? "streaming" : "ready";
}

void publishStatus(bool forceConfig = false);
void configureLightSensor();

void serviceMqttDuringRtspWrite() {
  if (g_mqttClient.connected()) g_mqttClient.loop();
  feedLoopWDT();
  delay(0);
}

void recordStatus(const String &message) {
  g_lastStatus = message;
  Serial.printf("[STAT] %s\n", message.c_str());
}

void statusf(const char *format, ...) {
  char buffer[192];
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, sizeof(buffer), format, args);
  va_end(args);
  recordStatus(buffer);
}

void setError(const String &message) {
  if (g_lastError == message) return;
  g_lastError = message;
  Serial.printf("[ERROR] %s\n", message.c_str());
  publishStatus();
}

void clearError() {
  if (g_lastError.length() == 0) return;
  g_lastError = "";
  publishStatus();
}

void setCommandResult(
    const String &command,
    const String &requestId,
    const String &result,
    const String &message) {
  g_lastCommandName = command;
  g_lastCommandId = requestId;
  g_lastCommandResult = result;
  g_lastCommandMessage = message;
  g_lastCommandAtMs = millis();
}

void applyLedState(bool enabled) {
  g_ledEnabled = enabled ? 1 : 0;
  digitalWrite(DFR_LED_PIN, enabled ? HIGH : LOW);
}

void applyIrState(bool enabled) {
  if (g_irEnabled == enabled) return;
  g_irEnabled = enabled;
  digitalWrite(DFR_IR_PIN, enabled ? HIGH : LOW);
  statusf("ir %s mode=%s lux=%.2f", enabled ? "on" : "off", irModeName(), g_ambientLux);
}

void evaluateIrAutomation() {
  if (g_irMode == 0) {
    applyIrState(false);
    return;
  }
  if (g_irMode == 1) {
    applyIrState(true);
    return;
  }
  if (!g_lightReady || !isfinite(g_ambientLux)) return;

  if (!g_irEnabled && g_ambientLux <= g_irOnBelowLux) {
    applyIrState(true);
  } else if (g_irEnabled && g_ambientLux >= g_irOffAboveLux) {
    applyIrState(false);
  }
}

