Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
bool readAmbientLuxNow() {
  if (!g_lightReady) return false;
  const uint32_t raw = g_lightSensor.getData();
  const double lux = g_lightSensor.getLux(raw);
  if (!isfinite(lux) || lux < 0.0) return false;
  g_ambientLux = static_cast<float>(lux);
  evaluateIrAutomation();
  return true;
}

void handleLightSensor() {
  if (!g_lightReady) return;
  const uint32_t now = millis();
  if (now - g_lastLightReadMs < dfrcfg::kLightReadIntervalMs) return;
  g_lastLightReadMs = now;
  readAmbientLuxNow();
}

void rebuildStreamer() {
  g_streamer.reset();
  if (!g_cameraReady || !g_streamEnabled || WiFi.status() != WL_CONNECTED) return;

  camera_fb_t *probe = esp_camera_fb_get();
  if (probe == nullptr) {
    setError("camera probe frame failed");
    return;
  }
  const uint16_t width = probe->width;
  const uint16_t height = probe->height;
  esp_camera_fb_return(probe);

  g_streamer.reset(new Esp32RtspStreamer(width, height));
  // Match the proven Micro-RTSP transport used before the reconnect changes.
  g_streamer->setNonBlockingTcpWrites(false);
  g_streamer->setServiceCallback(serviceMqttDuringRtspWrite);
  const String hostPort = WiFi.localIP().toString() + ":" + String(dfrcfg::kRtspPort);
  g_streamer->setURI(hostPort, dfrcfg::kRtspPresentation, dfrcfg::kRtspStream);
  statusf("rtsp ready url=%s", rtspUrl().c_str());
}

void ensureRtspServer() {
  if (g_rtspServerStarted) return;
  g_rtspServer.begin();
  g_rtspServerStarted = true;
  statusf("rtsp server listening port=%u", dfrcfg::kRtspPort);
}

void publishSimple(const char *suffix, const String &value, bool retain = true) {
  if (g_mqttClient.connected()) {
    if (!g_mqttClient.publish(mqttTopic(suffix).c_str(), value.c_str(), retain)) {
      ++g_mqttPublishFailures;
    }
  }
}

String buildConfigJson() {
  String json = "{";
  json.reserve(768);
  json += "\"framesize\":" + String(frameSizeToIndex(g_frameSize));
  json += ",\"framesize_name\":\"" + String(frameSizeName()) + "\"";
  json += ",\"jpeg_quality\":" + String(g_jpegQuality);
  json += ",\"stream_fps\":" + String(g_streamFps);
  json += ",\"brightness\":" + String(g_brightness);
  json += ",\"contrast\":" + String(g_contrast);
  json += ",\"saturation\":" + String(g_saturation);
  json += ",\"sharpness\":" + String(g_sharpness);
  json += ",\"gainceiling\":" + String(g_gainCeiling);
  json += ",\"colorbar\":" + String(g_colorbar);
  json += ",\"awb\":" + String(g_awb);
  json += ",\"agc\":" + String(g_agc);
  json += ",\"aec\":" + String(g_aec);
  json += ",\"awb_gain\":" + String(g_awbGain);
  json += ",\"agc_gain\":" + String(g_agcGain);
  json += ",\"aec_value\":" + String(g_aecValue);
  json += ",\"aec2\":" + String(g_aec2);
  json += ",\"dcw\":" + String(g_dcw);
  json += ",\"bpc\":" + String(g_bpc);
  json += ",\"wpc\":" + String(g_wpc);
  json += ",\"raw_gma\":" + String(g_rawGma);
  json += ",\"lenc\":" + String(g_lenc);
  json += ",\"special_effect\":" + String(g_specialEffect);
  json += ",\"wb_mode\":" + String(g_wbMode);
  json += ",\"ae_level\":" + String(g_aeLevel);
  json += ",\"hmirror\":" + String(g_hmirror);
  json += ",\"vflip\":" + String(g_vflip);
  json += ",\"led\":" + String(g_ledEnabled);
  json += ",\"stream_enabled\":";
  json += g_streamEnabled ? "true" : "false";
  json += ",\"ir_mode\":" + String(g_irMode);
  json += ",\"ir_mode_name\":\"" + String(irModeName()) + "\"";
  json += ",\"ir_enabled\":";
  json += g_irEnabled ? "true" : "false";
  json += ",\"ir_on_lux\":" + String(g_irOnBelowLux, 1);
  json += ",\"ir_off_lux\":" + String(g_irOffAboveLux, 1);
  json += ",\"server_capture_enabled\":";
  json += dfrcapture::enabled() ? "true" : "false";
  json += ",\"server_capture_interval_seconds\":" + String(dfrcapture::intervalSeconds());
  json += ",\"psram\":";
  json += g_psramReady ? "true" : "false";
  json += "}";
  return json;
}

void publishStatus(bool forceConfig) {
  static String previousConfig;
  if (!g_mqttClient.connected()) return;

  publishSimple("status/online", "true");
  publishSimple("status/state", streamState());
  publishSimple("status/error", g_lastError);
  publishSimple("status/ip", WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "-");
  publishSimple("status/rtsp_url", rtspUrl());
  publishSimple("status/mdns", String(dfrcfg::kMdnsHostname) + ".local");
  publishSimple("status/last_status", g_lastStatus);
  publishSimple("status/clients", String(directStreamingSessionCount()));
  publishSimple("status/direct_sessions", String(directSessionCount()));
  publishSimple("status/direct_streaming_clients", String(directStreamingSessionCount()));
  publishSimple("status/frame_fps", String(g_lastMeasuredFps, 1));
  publishSimple("status/configured_fps", String(g_streamFps));
  publishSimple("status/mqtt_connected", "true");
  publishSimple("status/wifi_rssi", String(WiFi.RSSI()));
  publishSimple("status/uptime_seconds", String(millis() / 1000UL));
  publishSimple("status/free_heap_bytes", String(ESP.getFreeHeap()));
  publishSimple("status/firmware_version", camcommon::kFirmwareVersion);
  publishSimple("status/wifi_reconnect_count", String(g_wifiReconnectCount));
  publishSimple("status/mqtt_reconnect_count", String(g_mqttReconnectCount));
  publishSimple("status/camera_recovery_count", String(g_cameraRecoveryCount));
  publishSimple("status/mqtt_publish_failures", String(g_mqttPublishFailures));
  publishSimple("status/ambient_lux", isfinite(g_ambientLux) ? String(g_ambientLux, 2) : "-");
  publishSimple("status/ir_mode", irModeName());
  publishSimple("status/ir_enabled", g_irEnabled ? "true" : "false");
  publishSimple("status/light_sensor", g_lightReady ? "ready" : "unavailable");
  publishSimple("status/capture_request/state", dfrcapture::state());
  publishSimple("status/capture_request/enabled", dfrcapture::enabled() ? "true" : "false");
  publishSimple("status/capture_request/interval_seconds", String(dfrcapture::intervalSeconds()));
  publishSimple("status/command/id", g_lastCommandId);
  publishSimple("status/command/name", g_lastCommandName);
  publishSimple("status/command/result", g_lastCommandResult);
  publishSimple("status/command/message", g_lastCommandMessage);
  publishSimple("status/command/at_ms", String(g_lastCommandAtMs));

  const String config = buildConfigJson();
  if (forceConfig || config != previousConfig) {
    publishSimple("status/config", config);
    previousConfig = config;
  }
}

