Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
bool initCamera() {
  g_cameraReady = false;
  g_psramReady = psramFound();
  if (!g_psramReady) {
    setError("DFR1154 PSRAM not detected");
    return false;
  }

  camera_config_t config = {};
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = DFR_CAM_Y2;
  config.pin_d1 = DFR_CAM_Y3;
  config.pin_d2 = DFR_CAM_Y4;
  config.pin_d3 = DFR_CAM_Y5;
  config.pin_d4 = DFR_CAM_Y6;
  config.pin_d5 = DFR_CAM_Y7;
  config.pin_d6 = DFR_CAM_Y8;
  config.pin_d7 = DFR_CAM_Y9;
  config.pin_xclk = DFR_CAM_XCLK;
  config.pin_pclk = DFR_CAM_PCLK;
  config.pin_vsync = DFR_CAM_VSYNC;
  config.pin_href = DFR_CAM_HREF;
  // Camera and LTR-308 share I2C0. Using the already configured bus prevents
  // the light sensor from invalidating the camera driver's SCCB handle.
  config.pin_sccb_sda = -1;
  config.pin_sccb_scl = -1;
  config.sccb_i2c_port = 0;
  config.pin_pwdn = DFR_CAM_PWDN;
  config.pin_reset = DFR_CAM_RESET;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = g_frameSize;
  config.jpeg_quality = g_jpegQuality;
  config.fb_count = 2;
  config.fb_location = CAMERA_FB_IN_PSRAM;
  config.grab_mode = CAMERA_GRAB_LATEST;

  const esp_err_t result = esp_camera_init(&config);
  if (result != ESP_OK) {
    setError("camera init failed: 0x" + String(static_cast<uint32_t>(result), HEX));
    return false;
  }

  g_cameraReady = true;
  applySensorSettings(false);
  g_cameraRecoveryFailures = 0;
  g_cameraRecoveryPending = false;
  statusf("camera ready sensor=OV3660 psram=%luMB frame=%s", ESP.getPsramSize() / (1024UL * 1024UL), frameSizeName());
  return true;
}

void shutdownCamera() {
  g_streamer.reset();
  if (!g_cameraReady) return;
  esp_camera_deinit();
  g_cameraReady = false;
}

bool restartCameraPipeline() {
  recordStatus("camera reconfiguring");
  shutdownCamera();
  delay(50);
  if (!initCamera()) return false;
  configureLightSensor();
  g_lastLightReadMs = 0;
  readAmbientLuxNow();
  rebuildStreamer();
  clearError();
  return true;
}

void requestCameraRecovery(const String &reason) {
  if (!g_cameraRecoveryPending) {
    statusf("camera recovery requested: %s", reason.c_str());
  }
  g_cameraRecoveryPending = true;
}

void handleCameraRecovery() {
  const uint32_t now = millis();

  if (g_cameraReady && !g_cameraRecoveryPending) {
    if (!g_streamEnabled || directStreamingSessionCount() > 0 ||
        now - g_lastCameraHealthCheckMs < 30000UL) {
      return;
    }
    g_lastCameraHealthCheckMs = now;
    camera_fb_t *frame = esp_camera_fb_get();
    if (frame != nullptr) {
      esp_camera_fb_return(frame);
      return;
    }
    requestCameraRecovery("health probe failed");
  }

  if (g_cameraReady && !g_cameraRecoveryPending) return;
  if (now - g_lastCameraRecoveryAttemptMs < 10000UL) return;
  g_lastCameraRecoveryAttemptMs = now;
  ++g_cameraRecoveryCount;

  if (restartCameraPipeline()) {
    g_cameraRecoveryFailures = 0;
    g_cameraRecoveryPending = false;
    statusf("camera recovery successful count=%lu", g_cameraRecoveryCount);
    return;
  }

  ++g_cameraRecoveryFailures;
  if (g_cameraRecoveryFailures >= 3) {
    statusf("camera recovery failed %u times; rebooting", g_cameraRecoveryFailures);
    delay(100);
    ESP.restart();
  }
}

void configureLightSensor() {
  g_lightReady = false;
  g_ambientLux = NAN;
  g_lightReady = g_lightSensor.begin();
  // DFRobot_LTR308::begin() selects 400 kHz. OV3660 SCCB register writes are
  // more reliable at the camera driver's normal 100 kHz bus speed.
  Wire.setClock(100000);
  if (!g_lightReady) {
    recordStatus("LTR-308 light sensor unavailable; IR auto mode suspended");
    return;
  }
  g_lightSensor.setMeasurementRate(
      DFRobot_LTR308::eConversion_100ms_18b,
      DFRobot_LTR308::eRate_500ms);
  g_lastLightReadMs = 0;
  readAmbientLuxNow();
  statusf("LTR-308 ready");
}

void configureOta() {
  if (g_otaReady || WiFi.status() != WL_CONNECTED) return;
  ArduinoOTA.setHostname(dfrcfg::kOtaHostname);
  if (strlen(dfrcfg::kOtaPassword) > 0) ArduinoOTA.setPassword(dfrcfg::kOtaPassword);
  ArduinoOTA.setMdnsEnabled(false);
  ArduinoOTA.onStart([]() {
    g_otaActive = true;
    g_streamer.reset();
    recordStatus("ota update started; camera stream suspended");
    publishStatus();
  });
  ArduinoOTA.onEnd([]() { recordStatus("ota update finished"); });
  ArduinoOTA.onProgress([](unsigned int, unsigned int) { feedLoopWDT(); });
  ArduinoOTA.onError([](ota_error_t error) {
    g_otaActive = false;
    setError("ota error=" + String(static_cast<uint32_t>(error)));
    rebuildStreamer();
  });
  ArduinoOTA.begin();
  g_otaReady = true;
  statusf("ota ready host=%s", dfrcfg::kOtaHostname);
}

void configureMdns() {
  if (g_mdnsReady || WiFi.status() != WL_CONNECTED) return;
  if (!MDNS.begin(dfrcfg::kMdnsHostname)) {
    recordStatus("mdns setup failed");
    return;
  }
  MDNS.addService("arduino", "tcp", 3232);
  MDNS.addService("rtsp", "tcp", dfrcfg::kRtspPort);
  g_mdnsReady = true;
}

void onWifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      g_wifiGotIpEvent = true;
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      g_wifiDisconnectReason = info.wifi_sta_disconnected.reason;
      g_wifiDisconnectedEvent = true;
      break;
    default:
      break;
  }
}

void handleWifiEvents() {
  if (g_wifiDisconnectedEvent) {
    g_wifiDisconnectedEvent = false;
    ++g_wifiReconnectCount;
    g_lastWifiAttemptMs = 0;
    g_otaActive = false;
    g_streamer.reset();
    g_rtspServer.end();
    g_rtspServerStarted = false;
    if (g_mqttClient.connected()) g_mqttClient.disconnect();
    g_mqttSocket.stop();
    g_lastMqttAttemptMs = 0;
    if (g_otaReady) {
      ArduinoOTA.end();
      g_otaReady = false;
    }
    if (g_mdnsReady) {
      MDNS.end();
      g_mdnsReady = false;
    }
    g_networkServicesPending = false;
    statusf("wifi disconnected reason=%u", g_wifiDisconnectReason);
  }

  if (g_wifiGotIpEvent) {
    g_wifiGotIpEvent = false;
    g_wifiAttemptCount = 0;
    g_lastWifiAttemptMs = 0;
    statusf("wifi ip=%s", WiFi.localIP().toString().c_str());
    if (!g_timeConfigured) {
      configTzTime(dfrcfg::kTimezone, dfrcfg::kNtpServer1, dfrcfg::kNtpServer2);
      g_timeConfigured = true;
    }
    g_networkServicesPending = true;
  }
}

void handleNetworkServices() {
  if (!g_networkServicesPending || WiFi.status() != WL_CONNECTED) return;
  g_networkServicesPending = false;
  configureMdns();
  configureOta();
  ensureRtspServer();
  rebuildStreamer();
}

